app/Http/Controllers/GetController.php

    public function inventory()
    {
        $inventories = Inventory::where('userId', Auth::user()->id)->orderBy('id', 'DESC')->get();
---
select * from `inventory` where `userId` = 137 order by `id` desc

    public function adminStock()
    {
        $stocks = Stock::where('delivery', 1)->get();
---
select * from `stock` where `delivery` = 1

    public function stockDelete(Request $request)
    {
        if (Auth::user()->permission == 2) {

        $stock = Stock::find($request->id);
---
select * from `stock` where `stock`.`id` = '12328' limit 1