app/Http/Controllers/PostController.php

select * from `generalsettings` where `generalsettings`.`id` = 1 limit 1
select * from `users` where `status` = 1 and `users`.`id` = '1' limit 1
---
    public function telegramMessage(Request $request){
    $generalSettings = GeneralSettings::find(1);
    $telegram = new Api($generalSettings->botTokens);

    $selectedUserIds = $request->userId;
    $successCount = 0;
    $failedCount = 0;
    $failedUsers = [];

    foreach ($selectedUserIds as $userId) {
        $users = User::where('status', '=', 1)->find($userId);